package copyfilecatalog;

import java.io.BufferedReader;
import java.io.File;
import java.io.IOException;
import java.io.InputStreamReader;

/**
 * Задача 3
 * Написать программу, которая копирует файлы из одного каталога в другой
 * (имена каталогов задаются при запуске программы)
 */

public class CopyFileInCatalog {

  /*  public static void main(String[] args) {


        if (args.length!=3){
            System.out.println("Необходимо задать следующие параметры: CopyFileInCatalog <file_copied>, <file_name>, <catalog1>, <catalog2>");

            return;
        }

        File fileOrigin  = new File(args[0]);
        File fileCopied = new File(args[1]);

        File catalogOrigin = new File(args[2]);
        File catalogCopied = new File(args[3]);


        try (BufferedReader readerFile = new BufferedReader()){

        }catch (IOException o){
            o.printStackTrace();
        }
    }*/
}
